Enums/ТипыРазделовМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыРазделовМедицинскихКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыводШаблонов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТемпературныйЛист</Name>
					<Comment>(УМЦ КОРП)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛистНазначенийСтационара</Name>
					<Comment>(УМЦ КОРП)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналТрансфузий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/МедицинскаяДеятельностьКлиентКОРП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ПЭМК

Процедура ОбновитьФакторыРискаНаКлиентаВПЭМК(Форма, КлиентИзменен) Экспорт
	
	СписокФакторовРиска = Форма.СписокФакторовРиска;
	
	Если КлиентИзменен Тогда
		ДокументыФР = МедицинскаяДеятельностьКОРП.ПолучитьДокументыФактораРиска(Форма.Клиент);
		Если ДокументыФР = Неопределено Тогда
			Форма.Элементы.ФакторыРиска.Видимость = Ложь;
		Иначе
			Форма.Элементы.ФакторыРиска.Видимость = Истина;
			СписокФакторовРиска = ДокументыФР;
		КонецЕсли;
	КонецЕсли;
	
	Если СписокФакторовРиска.Количество() <> 0 Тогда
		Форма.ФакторыРиска.Очистить();
		ДокументыФРСОтбором = МедицинскаяДеятельностьКОРП.ПроизвестиОтборМассиваФакторовРиска(СписокФакторовРиска, Форма.ДатаНачала, Форма.ДатаОкончания, Форма.Врач, Форма.Специализация);
		Если ДокументыФРСОтбором.Количество() <> 0 Тогда
			Для Каждого стр ИЗ ДокументыФРСОтбором Цикл
				Строка = Форма.ФакторыРиска.Добавить();
				Строка.Документ = стр.Значение;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПолеОсмотраПЭМКПоФакторамРиска(Форма) Экспорт
	
	Если Не Форма.МногостраничныйПросмотр Тогда
		ТекущиеДанные = Форма.Элементы.ФакторыРиска.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекстHTMLФакторыРиска = МедицинскаяДеятельностьКОРП.ПолучитьHTMLПредставлениеДокумента(ТекущиеДанные.Документ);
			ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTMLФакторыРиска);
			Форма.ПолеОсмотр = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьОтчетКонтролиБеременности(Клиент) Экспорт
	
	ПараметрыЗаплнения = Новый Структура("Клиент", Клиент);
	ОткрытьФорму("Отчет.КонтрольБеременности.Форма.ФормаОтчета", ПараметрыЗаплнения);
	
КонецПроцедуры

Процедура СформироватьОбщийТекстПриемовПриЗагрузкеПЭМК(Форма, СтрокиДокументов, ТекстHTML, ТекстHTMLПриемов, СтрокаПеренос, СтрокаПереходСтроки) Экспорт
	
	Если ПустаяСтрока(ТекстHTML) Тогда
		ТекстHTML = РаботаСHTMLКлиентСервер.ПолучитьТекстHTMLПустогоДокумента();
	КонецЕсли;
	
	// Формируется общий текст приемов
	Если Форма.Элементы.ФакторыРиска.Видимость = Истина Тогда
		
		ТекстHTMLПриемов = "";
		
		Для Каждого СтрДок Из Форма.ФакторыРиска Цикл
			СтрокиДокументов.Добавить(Новый Структура("Ссылка, Показывать, ТекстОсмотра", СтрДок.Документ, СтрДок.Показывать));
		КонецЦикла;
		
		УпорядочитьСписокДокументовПриемаИФакторыРиска(СтрокиДокументов);
		
		Для Каждого Док Из СтрокиДокументов Цикл
			
			Если Док.Показывать Тогда
				РазделительПриёмов = ?(Док = СтрокиДокументов[0] Или Форма.ПечататьКаждыйПриемНаНовомЛисте, СтрокаПеренос, СтрокаПереходСтроки);
				Ссылка = ?(ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Док, "ДокументПриема"), Док.ДокументПриема, Док.Ссылка);
				Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Прием") Тогда
					ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ТекстHTMLПриемов, Док.ТекстОсмотра, РазделительПриёмов);
				ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасчетФакторовРиска") Тогда
					ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ТекстHTMLПриемов, МедицинскаяДеятельностьКОРП.ПолучитьHTMLПредставлениеДокумента(Док.Ссылка), РазделительПриёмов);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДаннымиПриЗагрузкаРазделаПоТипуПЭМК(Форма, ОписаниеРаздела, ТекстРаздела) Экспорт
	
	Если ОписаниеРаздела.ТипРаздела = ПредопределенноеЗначение("Перечисление.ТипыРазделовМедицинскихКарт.ТемпературныйЛист") Тогда
		ТемпературныйЛист = Стационар.СформироватьТемпературныйЛистДляЭМК(Форма.Клиент, Форма.МедицинскаяКарта, Форма.ДатаНачала, Форма.ДатаОкончания);
		Если ТемпературныйЛист <> Неопределено Тогда
			СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТемпературныйЛист, 0, , "Температурный лист", Строка(Форма.Клиент), Форма.МедицинскаяКарта);
			ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать, Форма.МедицинскаяКарта);
		КонецЕсли;
	ИначеЕсли ОписаниеРаздела.ТипРаздела = ПредопределенноеЗначение("Перечисление.ТипыРазделовМедицинскихКарт.ЛистНазначенийСтационара") Тогда
		ЛистНазначений = Стационар.СформироватьЛистНазначенийДляЭМК(Форма.Клиент, Форма.МедицинскаяКарта, Форма.ДатаНачала, Форма.ДатаОкончания);
		Если ЛистНазначений <> Неопределено Тогда
			СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ЛистНазначений, 0, , "Лист назначений и их выполнение", Строка(Форма.Клиент), Форма.МедицинскаяКарта);
			ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать, Форма.МедицинскаяКарта);
		КонецЕсли;
	ИначеЕсли ОписаниеРаздела.ТипРаздела = ПредопределенноеЗначение("Перечисление.ТипыРазделовМедицинскихКарт.ЖурналТрансфузий") Тогда
		ЖурналТрансфузий = Стационар.СформироватьЖурналТрансфузийДляЭМК(Форма.Клиент, Форма.МедицинскаяКарта);
		Если ЖурналТрансфузий <> Неопределено Тогда
			НаименованиеРаздела = "Лист регистрации трансфузии (переливания) донорской крови и (или) ее компонентов";
			СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ЖурналТрансфузий, 0, , НаименованиеРаздела, Строка(Форма.Клиент), Форма.МедицинскаяКарта);
			ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать, Форма.МедицинскаяКарта);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УпорядочитьСписокДокументовПриемаИФакторыРиска(СтрокиДокументов)
	
	Сортировщик = Новый СписокЗначений;
	
	Для Сч = 0 По СтрокиДокументов.Количество() - 1 Цикл
		СтрокаДокумента = СтрокиДокументов[Сч];
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДокумента, "ДокументПриема")
			И ТипЗнч(СтрокаДокумента.ДокументПриема) = Тип("ДокументСсылка.Прием")
		Тогда
			ДатаДокумента = СтрокаДокумента.ДатаДокументаПриема;
		ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДокумента, "Ссылка")
			И ТипЗнч(СтрокаДокумента.Ссылка) = Тип("ДокументСсылка.РасчетФакторовРиска")
		Тогда
			ДатаДокумента = ДопСерверныеФункции.ПолучитьРеквизит(СтрокаДокумента.Ссылка, "Дата");
		Иначе
			ДатаДокумента = Дата(3999,1,1);
		КонецЕсли;
				
		Сортировщик.Добавить(Сч, Формат(ДатаДокумента, "ДФ='yyyy.MM.dd HH.mm.ss'"));

	КонецЦикла;
	
	Сортировщик.СортироватьПоПредставлению();
	
	НовыеСтроки = Новый Массив;
	Для Сч = 0 По СтрокиДокументов.Количество() - 1 Цикл
		
		НовыеСтроки.Добавить(СтрокиДокументов[Сортировщик[Сч].Значение]);
		
	КонецЦикла;
	
	СтрокиДокументов = НовыеСтроки;
	
КонецПроцедуры

#КонецОбласти
